//#include <iostream>
//
//using namespace std;
//
//int main() {
//	// + - * / %
//	/* / : 첫 번째 피연산자에서 두 번째 피연산자를 나눕니다.
//	  >> 두 개의 피연산자가 모두 정수이면 결과값은 '몫'입니다.
//	  % : 첫 번째 피연산자를 두 번째 피연산자로 나누어 나머지를 구합니다.
//	  예를 들어 19를 6으로 나누게 되면 그 값은 1입니다.
//	  부동 소수점(실수) 사용할 수 없습니다.*/
//
//	// C++가 복잡한 산술 연산을 수행할 수 있을까? > 있습니다.
//
//	// auto
//
//	auto n = 100; //n은 int
//	auto x = 1.5; //x는 float
//	auto y = 1.3e12L; //y는 long long
//
//	/* 주의
//	auto n = 0.0; //n은 float
//	float x = 0; //x는 float
//	auto y = 0; //y는 int
//	*/
//	return 0;
//}